SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-84013T-B

Comment( British Rail STD 2MT 84013 2-6-2 Tank Engine )
	
Comment ( General Information Included in this section - Type, Shape, Size, Mass, etc )

Type ( Engine )
WagonShape ( DR_BR_2MT_84013.s )
Size  ( 2.79516m 3.96468m 11.627389m )
Mass ( 66.05t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 0cm 0cm )
              )
          CouplingHasRigidConnection (1)
     )  

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 140kN ) Comment(53% MT Weight*Cof 0.5)
MaxHandbrakeForce ( 50kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.5m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 4593 )
ORTSDavis_B ( 22.08 )
ORTSDavis_C ( 5.075 )

ORTSWagonFrontalArea (95ft^2)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	( 8
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( -0 2.0 -2.23 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -0 2.1 -2.23 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
								)
						)
			)
		Light	(
			comment( Cab glow )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				TimeOfDay ( 0 )

			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff7200 )
					Position ( 0 2.2 -2.24 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.2 )
					)
				)
			)
		Light	(
			comment( flickering fire underneath LHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 0 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 1 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( flickering fire underneath RHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 0 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( Front White Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( aaffffee )
						Position ( 0 3.13 4.56 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Front Red Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( 80ff0000 )
						Position ( 0 3.13 4.56 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Rear Red Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0 3.25 -5.65 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		Light	(
			comment( Rear White Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaffffee )
					Position ( 0 3.25 -5.65 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		)


Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

FreightAnim ( "..\\common.crew\\LIB_2\\Std2Tank.s" 0 3.0 0.0 )

Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( DR_BR_2MT_84013.s )
        PassengerCabinHeadPos ( 1.455 2.95 -2 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	IntakePoint ( 0.9 10 FuelWater )
	IntakePoint ( -0.9 8 FuelCoal )
    
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)

Engine ( OR-84013T-B
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 3.781 -1.2
				0 1 0
				0.3
			)

			SafetyValvesFX
			(
				0 3.971 -0.85
				0 1 0
				0.3
			)
			SafetyValvesFX
			(
				0 3.971 -1.1
				0 1 0
				0.3
			)
			StackFX
			(
				0 3.996 3.6
				0 1 0
				0.3
			)
			StackFX
			(
				0 3.996 3.6
				0 1 0
				0.25
			)
			StackFX
			(
				0 3.996 3.6
				0 0.95 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			Injectors2FX
			(
				1.22 0.55 -2.7
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.22 0.55 -2.9
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-0.965 0.6 4.3
				0 0.1 1
				0.20
			)

			CylindersFX
			(
				0.965 0.6 4.3
				0 0.1 1
				0.20
			)
		)
	)

Wagon ( OR-84013T-B )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 30in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 41.25t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 135ft^3 ) 
ORTSEvaporationArea ( 1025ft^2 )
ORTSSuperheatArea ( 124ft^2 )
MaxBoilerPressure ( 200psi )
MaxSteamHeatingPressure ( 70psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 24in ) 
CylinderDiameter ( 16.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 17.5ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 3t-uk )
MaxTenderWaterMass ( 13500lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15.0 )

ORTSMaxIndicatedHorsepower ( 850.0hp )

ORTSMaxSuperheatTemperature ( 230.0 )

Comment(ORTSSuperheatCutoffPressureFactor ( 55.0 ))Comment(Default)

Comment(ORTSCylinderPortOpening ( 0.085 ))Comment(0.05 to 0.12)

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 ) Comment(From 4MT Report)

ORTSBurnRate( 0.0 10.0  7875.0 1000.0  12337.0 2000.0  14875.0 2500.0  16275.0 3000.0  18375.0 3500.0 ) Comment(From Pawson Graph)

ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 )

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

Comment ( ***********Gearing (If used) *************************
Included in this section - Gear type, ratio, etc )

Comment ( *****************Brake System ********************        Included in this section - Compressor, Reservoir, Application rates, etc )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control System (if used)**********        
Includes Monitoring of Overspeed, Vigilance, Emergency Braking)

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

Cabview ( Standard2Tank.cvf )
HeadOut (  -1.455 2.95 -2 )
 
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
    	Name ( "84013-Standard 2MT Tank, Class B, Coal 3t, Water 1350gal, Reverse Cab" )
 	Description (
 	"The class was designed at Derby Works and introduced in 1953. The design derived from the LMS Ivatt Class 2 2-6-2T which BR had built after nationalisation. Modifications were made to the Ivatt design including a reduced cab to reduce the loading gauge and some standard fittings. BR classified them 2MT, emphasising a mixed-traffic role. \n"+
"As most services which required 2MT 2-6-2Ts were already served by the 130 Ivatt engines, B.R. only ordered 30 engines, which eliminated pre-grouping steam locomotives as much as possible on local services."
)
)
